# using string patterns and ranges

In [1]:
import pandas as pd
import sqlite3 as sql

In [2]:
cnn = sql.connect('test.db')

In [5]:
%load_ext sql

In [6]:
%sql sqlite:///test.db

##  % (wild card character) is used to for missing elements

In [10]:
%%sql 
select * from people where name like'%a%'

 * sqlite:///test.db
Done.

[(0, 'amruth', 23, 'richardson'),
 (1, 'akshath', 34, 'bangalore'),
 (2, 'sharath', 32, 'tonoto')]

# Range

In [11]:
%%sql
select * from people where age>=30 and age<=40

 * sqlite:///test.db
Done.

[(1, 'akshath', 34, 'bangalore'), (2, 'sharath', 32, 'tonoto')]